/*********************************************
* @文件: driverTime.h
* @作者: wuhuiskt
* @版本: v1.0.1
* @时间: 2017-11-14
* @概要: 定义时间处理接口，统计
                   滴答时间。由时钟中断接
                   口调用计时。
*********************************************/
#ifndef DRIVER_TIME_H
#define DRIVER_TIME_H

#ifdef __cplusplus
extern "C" {
#endif //end __cplusplus

#include "baseType.h"

#define HZ 100 //时钟中断频率

/*  定义系统的滴答数，精确到ms
	当统计到1000ms，秒数加一
*/
typedef struct tagTimeTick
{
	T_U32 u32Sec; //s
	T_S32 s32MSec;//ms
}TimeTick;

/*********************************************
 *功能：时间计数器初始化
 *输入：无
 *输出：无.
 *条件：无
 *返回：成功0失败-1
 注意:无。
**********************************************/
T_S32 MDL_TIME_Init(T_VOID);
/*********************************************
 *功能：统计时钟滴答数
 *输入：无
 *输出：无.
 *条件：无
 *返回：无
 注意:无。
*********************************************/
T_VOID MDL_TIME_InterruputHandle(T_VOID);
/*********************************************
 *功能：获取时钟滴答数
 *输入：无
 *输出：无.
 *条件：无
 *返回：无
 注意:无。
*********************************************/
T_VOID MDL_TIME_GetTimeTick(TimeTick *pstTimeTick);
/*********************************************
 *功能：延时
 *输入：延时时间
 *输出：无.
 *条件：无
 *返回：无
 注意:无。
*********************************************/
T_VOID MDL_TIME_Delay(T_U32 u32Ms);

#ifdef __cplusplus
}
#endif //end __cplusplus

#endif //end __TIME_H
