/*********************************************
* @文件: driverRtc.h
* @作者: wuhuiskt
* @版本: v1.0.1
* @时间: 2017-12-13
* @概要: 提供RTC时钟接口，驱动模
                  块调用相关接口实现RTC时
                  间获取功能。
*********************************************/

#ifndef RTC_H
#define RTC_H

#ifdef __cplusplus
extern "C" {
#endif //end __cplusplus

#include "baseType.h"

typedef struct tagRtcModule
{
	T_S32 (*RtcRead)(T_S8 *ps8RtcBuf);
	T_S32 (*RtcWrite)(T_S8 *ps8RtcBuf);
	T_S32 (*RtcSetTimer)(T_U32 u32Time);
}RtcModule;

/********************************************
 *功能：初始化RTC模块
 *输入：RTC模块
 *输出：无.
 *条件：无
 *返回：成功0失败-1
 注意:无。
*********************************************/
T_S32 MDL_RTC_Init(T_VOID);
/********************************************
 *功能：添加RTC模块
 *输入：RTC模块
 *输出：无.
 *条件：无
 *返回：成功0失败-1
 注意:无。
*********************************************/
T_S32 MDL_RTC_AddModel(RtcModule *pstRtcModel);
/********************************************
 *功能：获取RTC时间
 *输入：年月日时分秒
 *输出：无.
 *条件：无
 *返回：成功0失败-1
 注意:无。
*********************************************/
T_S32 MDL_RTC_Read(T_S8 *ps8RtcBuf);
/********************************************
 *功能：设置RTC时间
 *输入：年月日时分秒
 *输出：无.
 *条件：无
 *返回：成功0失败-1
 注意:无。
*********************************************/
T_S32 MDL_RTC_Write(T_S8 *ps8RtcBuf);
/********************************************
 *功能：设置RTC定时时间
 *输入：超时时间
 *输出：无.
 *条件：无
 *返回：成功0失败-1
 注意:无。
*********************************************/
T_S32 MDL_RTC_SetTimer(T_U32 u32Time);

#ifdef __cplusplus
}
#endif //end __cplusplus

#endif //end RTC_H

