/*********************************************
* @文件: driverGps.h
* @作者: wuhui
* @版本: v1.0.1
* @时间: 2019-7-15
* @概要: 提供GPS模块驱动接口 
*********************************************/

#ifndef __DRIVER_GPS__
#define __DRIVER_GPS__

#ifdef __cplusplus
extern "C" {
#endif

#include "baseType.h"

/************************************************
 *功能：将GPS驱动模块添加到
 			驱动列表中。
 *输入：无
 *输出：无
 *条件：无
 *返回：成功0失败-1
 注意:
*************************************************/
T_S32 DRIVER_Gps_Init(T_VOID);

#ifdef __cplusplus
}
#endif

#endif
